{
    "meta": {
        "url": "https://news.google.com/news?q=santa%20claus", 
        "timestamp": "2016-11-12 10:45:26.968414"
    }, 
    "stories": [
        {
            "category": "santa claus", 
            "source": "cleveland.com", 
            "content_snippet": "SANTA CLAUS, Indiana -- Our 7-year-old son sits at an old school desk and places a tight grip on a No. 2 pencil, then begins crafting a letter to Santa.", 
            "link": "http://www.cleveland.com/travel/index.ssf/2016/11/santa_claus_indiana_shines_wit.html", 
            "title": "Santa Claus, Indiana, shines with holiday spirit in every season (photos)"
        }, 
        {
            "category": "santa claus", 
            "source": "CBC.ca", 
            "content_snippet": "Kris Kringle is closing traffic in Winnipeg Saturday. The man in the red suit will make his way down Portage Avenue for the annual Santa Claus Parade at 5 p.m.. Several streets downtown will start to close in advance of Kringle's appearance at 1:30 p.m..", 
            "link": "http://www.cbc.ca/news/canada/santa-claus-parade-winnipeg-1.3848357", 
            "title": "Winnipeg roads closed, buses rerouted for Santa Claus Parade"
        }, 
        {
            "category": "santa claus", 
            "source": "KCCI Des Moines", 
            "content_snippet": "He arrived at Valley West Mall in West Des Moines Friday night in a white convertible, meeting with Des Moines-area kids to find out what they want for Christmas.", 
            "link": "http://www.kcci.com/article/santa-claus-arrives-in-the-metro-in-style/8282111", 
            "title": "Santa Claus arrives in the metro in style"
        }, 
        {
            "category": "santa claus", 
            "source": "Game Rant", 
            "content_snippet": "Brand new gameplay footage of the upcoming Dead Rising 4 surfaces that details the game's enemy types, including a maniacal pirate, mascot, and Santa ...", 
            "link": "https://gamerant.com/dead-rising-4-video-killer-santa-claus/", 
            "title": "Dead Rising 4 Video Features Killer Santa Claus - Game Rant"
        }, 
        {
            "category": "santa claus", 
            "source": "Telegraph.co.uk", 
            "content_snippet": "Mrs Claus sends her husband, Santa Claus, off on his sleigh before secretly turning to her secret lair, dressing in red and shooting off on a ski-jet and helicopter, named R-DOLF, to deliver Anna's surprise Christmas present - a pair of new ...", 
            "link": "http://www.telegraph.co.uk/business/2016/11/11/ms-turns-to-mrs-claus-for-christmas-2016-advert/", 
            "title": "M&S turns to Mrs Claus for Christmas 2016 advert"
        }, 
        {
            "category": "santa claus", 
            "source": "KTUU.com", 
            "content_snippet": "That decision, however, has been met with disappointment from one of the city's most famous residents: Santa Claus. Santa Claus, formerly known as Thomas O'Connor, legally changed his name to Santa in 2005. He says the moniker helps with his work as ...", 
            "link": "http://www.ktuu.com/content/news/Santa-Claus-speaks-out-against-North-Pole-ban-of-marijuana-sales-400085091.html", 
            "title": "Santa Claus speaks out against North Pole ban of marijuana sales"
        }, 
        {
            "category": "santa claus", 
            "source": "Gizmodo", 
            "content_snippet": "He sees you when you're sleeping. He knows when you're awake. He didn't see that parked car though so you're probably off the hook.", 
            "link": "http://sploid.gizmodo.com/santa-claus-is-coming-to-splat-1788682914", 
            "title": "Santa Claus Is Coming to *Splat*"
        }, 
        {
            "category": "santa claus", 
            "source": "The Telegraph (blog)", 
            "content_snippet": "Although Christmas was more than a month away, Santa Claus spent Nov. 8 at the Northeast poll. Just inside the door to the polling room at Northeast High School on election day, 58-year-old Glen Heald sat in a chair against the wall.", 
            "link": "http://www.macon.com/news/local/news-columns-blogs/political-notebook/article114290863.html", 
            "title": "Santa at the Northeast poll on election day"
        }, 
        {
            "category": "santa claus", 
            "source": "WISN Milwaukee", 
            "content_snippet": "CLAUS CAN'T AVOID IT SOMETIMES. TODAY WE CAUGHT UP WITH THEM AT THE DOUGLAS COUNTY COURTHOUSE ON OFFICIAL BUSINESS. IT'S NOT SOMETHING YOU EXPECT TO SEE EVERY DAY.", 
            "link": "http://www.wisn.com/article/mr-and-mrs-santa-claus-are-now-official/8258678", 
            "title": "Mr. and Mrs. Santa Claus are now official"
        }, 
        {
            "category": "santa claus", 
            "source": "Patch.com", 
            "content_snippet": "Santa Claus, played by Joe Skarupa, a perennial Santa-About-Town, will arrive by hook-and-ladder down Reef Road at 10 a.m. He will sit in the gazebo until approximately 2 p.m.", 
            "link": "http://patch.com/connecticut/fairfield/santa-claus-coming-fairfield-soon", 
            "title": "Santa Claus is Coming to Fairfield Soon"
        }, 
        {
            "category": "santa claus", 
            "source": "USA TODAY", 
            "content_snippet": "WICHITA FALLS, Texas --- Toys that were supposed to be given away as part of the Wichita Falls Fire Department's Operation Santa Claus were stolen earlier this week, according to fire officials. Fire department officials said the toys were stored in a ...", 
            "link": "http://www.usatoday.com/story/news/nation-now/2016/11/10/thieves-steal-operation-santa-claus-toys-texas/93583702/", 
            "title": "Thieves steal Operation Santa Claus toys in Texas"
        }, 
        {
            "category": "santa claus", 
            "source": "The Daily Progress", 
            "content_snippet": "HOUSTON (AP) - For two months of the year, Houston aircraft mechanic Lance McLean trades in his coveralls at the end of the day for a red Santa suit. The Houston Chronicle (http://bit.ly/2eD3unn ) reports this year McLean will don the suit 49 times, ...", 
            "link": "http://www.dailyprogress.com/ho-ho-houston-aircraft-mechanic-portrays-santa-claus/article_e55ac2ca-05b4-5c78-b86d-019cad940578.html", 
            "title": "Ho Ho! Houston aircraft mechanic portrays Santa Claus"
        }, 
        {
            "category": "santa claus", 
            "source": "The indy100", 
            "content_snippet": "Mr Santa Claus - originally Thomas O'Connor until he legally changed it in 2005 - uses doctor-recommended marijuana to help ease the symptoms he suffers as a result of having two types of cancer, which were diagnosed four years ago.", 
            "link": "https://www.indy100.com/article/santa-north-pole-christmas-marijuana-united-states-cannabis-7400956", 
            "title": "Santa Claus is trying to stop a North Pole marijuana ban"
        }, 
        {
            "category": "santa claus", 
            "source": "Detroit Free Press", 
            "content_snippet": "Children can meet Santa Claus and tell him their holiday wishes next month in Southfield at the 2016 Black Santa Photo Experience.", 
            "link": "http://www.freep.com/story/news/local/michigan/oakland/2016/11/09/black-santa-claus-christmas-southfield-metro-detroit/93547418/", 
            "title": "Black Santa returns to Southfield next month"
        }, 
        {
            "category": "santa claus", 
            "source": "Hopatcong Lake Regional News (registration)", 
            "content_snippet": "So gather up those eager children and join Santa, Mrs. Claus, and Rudolph on Saturday, December 3 at the Community Lodge at Camp Jefferson located at 81 Weldon Road.", 
            "link": "http://www.hopatconglakeregionalnews.com/index.php/news/jefferson-region/807-santa-claus-is-coming-to-town-jefferson-township-that-is#!/ccomment", 
            "title": "Santa Claus is coming to town… Jefferson Township that is!"
        }, 
        {
            "category": "santa claus", 
            "source": "HIGH TIMES", 
            "content_snippet": "In the small town of North Pole, Alaska, where they say, “the spirit of Christmas lives year round,” the voters have refused to allow retail pot shops to sell the stoner's mistletoe throughout the community, which has one prominent resident by the name ...", 
            "link": "http://hightimes.com/culture/santa-claus-supports-marijuana-legalization/", 
            "title": "Santa Claus Supports Marijuana Legalization"
        }, 
        {
            "category": "santa claus", 
            "source": "South China Morning Post", 
            "content_snippet": "The South China Morning Post's annual charity campaign Operation Santa Claus was launched Wednesday night with the theme 'small change, big change', and calling for donations, regardless of size, for 23 of the city's local charity projects.", 
            "link": "http://www.scmp.com/news/hong-kong/education-community/article/2044510/operation-santa-claus-connecting-hong-kong", 
            "title": "Operation Santa Claus connecting the Hong Kong community with a good cause"
        }, 
        {
            "category": "santa claus", 
            "source": "Boothbay Register", 
            "content_snippet": "The Damariscotta Region Chamber of Commerce is excited that Santa has accepted our invitation to visit Damariscotta on Saturday, Nov. 26.", 
            "link": "http://www.boothbayregister.com/article/santa-claus-coming-damariscotta-nov-26/78442", 
            "title": "Santa Claus coming to Damariscotta Nov. 26"
        }, 
        {
            "category": "santa claus", 
            "source": "NBC4i.com", 
            "content_snippet": "Among those just saying no is the tiny town of North Pole, and that's not sitting well with the town's most famous resident: Santa Claus has put medical marijuana on his “nice” list. The man who legally changed his name to “Santa Claus” is deeply ...", 
            "link": "http://nbc4i.com/2016/11/03/santa-claus-endorses-medical-marijuana/", 
            "title": "Santa Claus endorses medical marijuana"
        }, 
        {
            "category": "santa claus", 
            "source": "Metro", 
            "content_snippet": "A man who legally changed his name to Santa Claus and dresses up as jolly old St Nick has spoken out about the law in his home - the city of North Pole, Alaska.", 
            "link": "http://metro.co.uk/2016/11/06/santa-claus-is-gutted-that-the-north-pole-has-banned-weed-6238345/", 
            "title": "Santa Claus is gutted that the North Pole has banned weed"
        }
    ]
}